khoih-prog/Ethernet_Manager/src/Adapters/Ethernet_ESP32_Manager.h
        for (uint8_t i = 0; i < NUM_MENU_ITEMS; i++)
        {       
          char* _pointer = readBuffer;

          // Actual size of pdata is [maxlen + 1]
          memset(readBuffer, 0, myMenuItems[i].maxlen + 1);
          
          file.readBytes(_pointer, myMenuItems[i].maxlen);
     
          ETM_LOGDEBUG3(F("ChkCrR:pdata="), readBuffer, F(",len="), myMenuItems[i].maxlen);      
                 
          for (uint16_t j = 0; j < myMenuItems[i].maxlen; j++,_pointer++)
          {         
            checkSum += *_pointer;  
          }       
        }

        file.readBytes((char *) &readCheckSum, sizeof(readCheckSum));
        
        ETM_LOGINFO(F("OK"));
        file.close();
        
        ETM_LOGINFO3(F("CrCCsum=0x"), String(checkSum, HEX), F(",CrRCsum=0x"), String(readCheckSum, HEX));
        
        // Free buffer
        delete [] readBuffer;
        ETM_LOGDEBUG(F("Buffer freed"));
        
        if ( checkSum != readCheckSum)
        {
          return true;
        }
      }  
      
      return false;    
    }
    
    //////////////////////////////////////////////

    bool loadDynamicData()
    {
      int checkSum = 0;
      int readCheckSum;
      totalDataSize = sizeof(Ethernet_Manager_config) + sizeof(readCheckSum);
      
      File file = FileFS.open(CREDENTIALS_FILENAME, "r");
      ETM_LOGINFO(F("LoadCredFile "));

      if (!file)
      {
        ETM_LOGINFO(F("failed"));

        // Trying open redundant config file
        file = FileFS.open(CREDENTIALS_FILENAME_BACKUP, "r");
        ETM_LOGINFO(F("LoadBkUpCredFile "));

        if (!file)
        {
          ETM_LOGINFO(F("failed"));
          return false;
        }
      }
     
      for (uint8_t i = 0; i < NUM_MENU_ITEMS; i++)
      {       
        char* _pointer = myMenuItems[i].pdata;
        totalDataSize += myMenuItems[i].maxlen;

        // Actual size of pdata is [maxlen + 1]
        memset(myMenuItems[i].pdata, 0, myMenuItems[i].maxlen + 1);
        
        file.readBytes(_pointer, myMenuItems[i].maxlen);
 
        ETM_LOGDEBUG3(F("CrR:pdata="), myMenuItems[i].pdata, F(",len="), myMenuItems[i].maxlen);       
               
        for (uint16_t j = 0; j < myMenuItems[i].maxlen; j++,_pointer++)
        {         
          checkSum += *_pointer;  
        }       
      }

      file.readBytes((char *) &readCheckSum, sizeof(readCheckSum));
      
      ETM_LOGINFO(F("OK"));
      file.close();
      
      ETM_LOGINFO3(F("CrCCsum=0x"), String(checkSum, HEX), F(",CrRCsum=0x"), String(readCheckSum, HEX));
      
      if ( checkSum != readCheckSum)
      {
        return false;
      }
      
      return true;    
    }

    //////////////////////////////////////////////
    
    void saveDynamicData()
    {
      int checkSum = 0;
    
      File file = FileFS.open(CREDENTIALS_FILENAME, "w");
      ETM_LOGINFO(F("SaveCredFile "));

      for (uint8_t i = 0; i < NUM_MENU_ITEMS; i++)
      {       
        char* _pointer = myMenuItems[i].pdata;
   
        ETM_LOGDEBUG3(F("CW1:pdata="), myMenuItems[i].pdata, F(",len="), myMenuItems[i].maxlen);
        
        if (file)
        {
          file.write((uint8_t*) _pointer, myMenuItems[i].maxlen);         
        }
        else
        {
          ETM_LOGINFO(F("failed"));
        }        
                     
        for (uint16_t j = 0; j < myMenuItems[i].maxlen; j++,_pointer++)
        {         
          checkSum += *_pointer;     
         }
      }
      
      if (file)
      {
        file.write((uint8_t*) &checkSum, sizeof(checkSum));     
        file.close();
        ETM_LOGINFO(F("OK"));    
      }
      else
      {
        ETM_LOGINFO(F("failed"));
      }   
           
      ETM_LOGINFO1(F("CrWCSum=0x"), String(checkSum, HEX));
      
      // Trying open redundant Auth file
      file = FileFS.open(CREDENTIALS_FILENAME_BACKUP, "w");
      ETM_LOGINFO(F("SaveBkUpCredFile "));

      for (uint8_t i = 0; i < NUM_MENU_ITEMS; i++)
      {       
        char* _pointer = myMenuItems[i].pdata;
  
        ETM_LOGDEBUG3(F("CW2:pdata="), myMenuItems[i].pdata, F(",len="), myMenuItems[i].maxlen);
        
        if (file)
        {
          file.write((uint8_t*) _pointer, myMenuItems[i].maxlen);         
        }
        else
        {
          ETM_LOGINFO(F("failed"));
        }        
                     
        for (uint16_t j = 0; j < myMenuItems[i].maxlen; j++,_pointer++)
        {         
          checkSum += *_pointer;     
         }
      }
      
      if (file)
      {
        file.write((uint8_t*) &checkSum, sizeof(checkSum));     
        file.close();
        ETM_LOGINFO(F("OK"));    
      }
      else
      {
        ETM_LOGINFO(F("failed"));
      }   
    }
#endif

    //////////////////////////////////////////////
    
    void NULLTerminateConfig()
    {
      //#define HEADER_MAX_LEN      16
      //#define STATIC_IP_MAX_LEN   16
      //#define BOARD_NAME_MAX_LEN  24
      
      // NULL Terminating to be sure
      Ethernet_Manager_config.header    [HEADER_MAX_LEN - 1]      = 0;
      Ethernet_Manager_config.static_IP [STATIC_IP_MAX_LEN - 1]   = 0;
      Ethernet_Manager_config.board_name[BOARD_NAME_MAX_LEN - 1]  = 0;
    }

    //////////////////////////////////////////////    

    bool loadConfigData()
    {
      ETM_LOGINFO(F("LoadCfgFile "));
      
      // file existed
      File file = FileFS.open(CONFIG_FILENAME, "r");
         
      if (!file)
      {
        ETM_LOGINFO(F("failed"));

        // Trying open redundant config file
        file = FileFS.open(CONFIG_FILENAME_BACKUP, "r");
        
        ETM_LOGINFO(F("LoadBkUpCfgFile "));

        if (!file)
        {
          ETM_LOGINFO(F("failed"));
          return false;
        }
      }
     
      file.readBytes((char *) &Ethernet_Manager_config, sizeof(Ethernet_Manager_config));

      ETM_LOGINFO(F("OK"));
      file.close();
      
      NULLTerminateConfig();
      
      return true;
    }

    void saveConfigData()
    {
      ETM_LOGINFO(F("SaveCfgFile "));

      int calChecksum = calcChecksum();
      Ethernet_Manager_config.checkSum = calChecksum;
      ETM_LOGINFO1(F("WCSum=0x"), String(calChecksum, HEX));
      
      File file = FileFS.open(CONFIG_FILENAME, "w");

