khoih-prog/Ethernet_Manager/src/Adapters/Ethernet_ESP32_Manager.h
        ETM_LOGDEBUG3(F("s:millis() = "), millis(), F(", configTimeout = "), configTimeout);
      }
      else
      {
        configTimeout = 0;             
        ETM_LOGDEBUG(F("s:configTimeout = 0"));   
      }  

      configuration_mode = true;
    }

    //////////////////////////////////////////////

    bool connectEthernet()
    {
      // Check go see if static IP is required
      IPAddress staticIP;
      
      if (staticIP.fromString(Ethernet_Manager_config.static_IP))
      {
        // Use static IP
        ETM_LOGWARN1(F("Start connectEthernet using Static IP ="), staticIP);
        
        // If macAddress valid, use it
        if (isMacAddressValid(macAddress))
          Ethernet.begin(SelectMacAddress(macAddress), staticIP);
        else
          Ethernet.begin(SelectMacAddress(nullptr), staticIP);
        
        ethernetConnected = true;
      }
      else
      {
        // If static_IP ="nothing" or nullptr, use DHCP dynamic IP
        ETM_LOGWARN(F("Start connectEthernet using DHCP"));
        
        // If macAddress valid, use it
        if (isMacAddressValid(macAddress))
          ethernetConnected = ( Ethernet.begin(SelectMacAddress(macAddress)) == 1);
        else  
          ethernetConnected = ( Ethernet.begin(SelectMacAddress(nullptr)) == 1);
      }
    
      // give the Ethernet shield a second to initialize:
      //delay(1000);
     
      if (ethernetConnected)
      {
        ETM_LOGWARN1(F("IP:"), Ethernet.localIP());
      }
      else
      {
        ETM_LOGWARN(F("DHCPFailed"));     
      }

      return ethernetConnected;
    }

    ///////////////////////////////////////////////////////////////////

    uint8_t* SelectMacAddress(const uint8_t* mac)
    {
      char localBuffer[24];
      
      if (isMacAddressValid(mac))
      {
        return (uint8_t*)mac;
      }

#if USE_ETHERNET_GENERIC  
      Ethernet.MACAddress(macAddress);
#endif
      
      printMacAddress();

      if (isMacAddressValid(macAddress))
      {
      	return macAddress;
      }
      
      // Initial mac to manipulate from
      macAddress[0] = 0xFE;
      macAddress[1] = 0xED;
      macAddress[2] = 0xDE;
      macAddress[3] = 0xAD;
      macAddress[4] = 0xBE;
      macAddress[5] = 0xEF;
      
#define TOKEN_LEN				8

      char token[TOKEN_LEN];
      uint32_t curTime = millis();
      snprintf(token, sizeof(token), "%ld", curTime * curTime);
     
      int mac_index = 1;
      
      ETM_LOGDEBUG3("token =", token, ", len =", TOKEN_LEN);
      
      for (uint16_t i = 0; i < TOKEN_LEN; i++)
      {
        macAddress[mac_index] ^= token[i];

        if (++mac_index > 5) 
        {
          mac_index = 1;
        }
      }
           
      snprintf(localBuffer, sizeof(localBuffer), "MAC:%02X-%02X-%02X-%02X-%02X-%02X",
                macAddress[0], macAddress[1],
                macAddress[2], macAddress[3],
                macAddress[4], macAddress[5]);
                
      ETM_LOGWARN1(F("Calculated =>"), localBuffer);

#if USE_ETHERNET_GENERIC      
      // Set for later use
      Ethernet.setMACAddress(macAddress);
#endif

      return macAddress;
    }
};

#endif    // Ethernet_ESP32_Manager_h
